const data = {
  General: [
    {
      quiz: "자기소개 해주세요.",
    },
    {
      quiz: "왜 프로그래머가 되기로 하셨나요?",
    },
    {
      quiz: "부트캠프에서 어떤 걸 배우셨나요?",
    },
    {
      quiz: "왜 프론트엔드에 지원하셨나요?",
    },
    {
      quiz: "문과였던 것 같은데 원래 전공과 지금이 다른 점이 무엇인가요?",
    },
    {
      quiz: "직업을 자주 바꾼 것 같은데 무엇이 본인의 직업을 바꾸게 했나요?",
    },
    {
      quiz: "근무기간이 짧은데 오래 일할 수 있을까요?",
    },
    {
      quiz: "꼭 이루고 싶은 꿈이 있나요? ",
    },
    {
      quiz: "3, 5, 10년 후 본인의 모습을 말해주세요.",
    },
    {
      quiz: "프로그래머로써 목표가 있을까요?",
    },
    {
      quiz: "취미가 어떻게 되시나요?",
    },
    {
      quiz: "스트레스 해소법이 있을까요?",
    },
    {
      quiz: "살면서 풀리지 않는 문제에 부딪힌 경험, 극복한 경험이 있을까요?",
    },
    {
      quiz: "경력이 없는데 왜 우리 회사가 당신을 뽑아야 하나요? 어떤 식으로 기여할 건가요?",
    },
    {
      quiz: "코드 짜다가 모르는 것이 나왔을 경우 어떻게 해결하나요?",
    },
    {
      quiz: "본인의 장단점을 어필해주세요.",
    },
    {
      quiz: "어떤 코드가 좋은 코드라고 생각하세요?",
    },
    {
      quiz: "어떤 동료가 좋은 동료라고 생각하세요?",
    },
    {
      quiz: "영어 잘 하나요?",
    },
    {
      quiz: "개발자로 전향을 결심한 이유가 무엇인가요?",
    },
    {
      quiz: "프론트엔드 개발자로 지원한 이유가 무엇인가요?",
    },
    {
      quiz: "요즘 관심을 가지고 있거나 개인적으로 공부하고 있는 기술이 있나요?",
    },
    {
      quiz: "개발 공부는 어떤 식으로 하셨나요?",
    },
    {
      quiz: "좋은 개발자, 좋은 코드는 무엇이라고 생각하시나요?",
    },
    {
      quiz: "렌더링 최적화 경험에 대해 설명해 주세요.",
    },
    {
      quiz: "본인만의 핵심 역량은 무엇인가요?",
    },
    {
      quiz: "개발자로서의 목표가 무엇인가요?",
    },
    {
      quiz: "원하는 근무 분위기가 있나요?",
    },
    {
      quiz: "이전 직장에서의 경험에 대해 설명해 주세요.",
    },
    {
      quiz: "주변으로부터 자주 받았던 피드백 내용은 무엇인가요?",
    },
    {
      quiz: "5년 후에 어떤 개발자가 되고 싶나요?",
    },
    {
      quiz: "출시된 서비스가 실패한 경우, 그 이유는 무엇이라고 생각하시나요?",
    },
    {
      quiz: "이 회사에 본인이 기여할 수 있는 점이 무엇이라고 생각하시나요?",
    },
    {
      quiz: "화가 나거나 스트레스를 받을 때 주로 어떻게 대처하시나요?",
    },
    {
      quiz: `함께 일하기 싫은 사람은 어떤 유형인가요?
      - 실제로 그런 사람을 만났을 경우에는 어떻게 대응하실 건가요?`,
    },
    {
      quiz: "개발을 할 때 가장 중요하다고 생각하는 요소가 무엇인가요?",
    },
    {
      quiz: "개발 과정에서 막히는 부분이 생겼을 때 어떻게 해결하시나요?",
    },
    {
      quiz: "입사 후, 정해진 기한 내에 맡은 task를 해결하지 못 할 것 같은 상황에서 어떻게 대처하실 건가요?",
    },
    {
      quiz: "원래 전공을 선택했던 이유는 무엇인가요?",
    },
    {
      quiz: "전공 선택 이후 해당 커리어패스를 선택하게 된 과정이 어떻게 되나요?",
    },
    {
      quiz: "이력서에서 다른 어필 포인트가 많았을 텐데 그 부분을 어필한 이유는 무엇인가요? 이와 관련해서 자신의 장점을 말해주세요.",
    },
    {
      quiz: "소프트웨어 중심 기업과 문화가 다른데 괜찮은가요?",
    },
    {
      quiz: "본인이 생각하는 일이란?",
    },
    {
      quiz: "회사를 선택할 때 중요한 부분이 무엇인가요?",
    },
    {
      quiz: "새로운 것을 빨리 배우는 편인가요? 그렇다면 최근에 빨리 배운 것은 무엇인가요?",
    },
    {
      quiz: "본인의 가장 큰 성공과 실패를 말해주세요.",
    },
    {
      quiz: "단기적인 목표를 희생해서 장기적인 목표를 이룬 경험이 있나요? 이에 대해 어떻게 생각하는지 말해주세요",
    },
    {
      quiz: "롤 모델이 있나요? 롤 모델을 닮아가려고 하는 노력들이 있다면 무엇인가요?",
    },
    {
      quiz: "1등을 해본 경험이 있나요?",
    },
    {
      quiz: "왜 우리 회사에 오고 싶나요?",
    },
    {
      quiz: "우리 회사에서 사용하는 스택들에 대한 지식이 있나요?",
    },
  ],
  JS: [
    {
      quiz: "식별자란?",
      answer: `식별자는 어떤 대상을 유일하게 식별할 수 있는 이름을 말한다. 식별자에는 변수명, 함수명, 프로퍼티명, 클래스명 등이 있다.식별자는 데이터가 저장된 메모리 상의 주소를 기억한다. 따라서 식별자를 통해 메모리에 저장된 값을 참조할 수 있다.`,
    },
    {
      quiz: "변수란?",
      answer: `변수는 값의 위치(주소)를 기억하는 저장소. 즉 변수란 값이 위치하고 있는 메모리 주소에 접근하기 위해 사람이 이해할 수 있는 언어로 명명한 식별자(identifier)이다.`,
    },
    {
      quiz: "undefined에 대해서 설명해주세요.",
      answer: `undefined 타입의 값은 undefined가 유일하다. 선언 이후 값을 할당하지 않은 변수는 undefined값을 가진다. 이는 변수 선언에 의해 확보된 메모리 공간을 처음 할당이 이루어질 때까지 빈 상태로 내버려두지 않고 자바스크립트 엔진이 undefined로 초기화 하기 때문이다.

      - undefined는 개발자가 의도적으로 할당한 값이 아니라 자바스크립트 엔진에 의해 초기화된 값이다. 변수를 참조했을 때 undefined가 반환된다면 참조한 변수가 선언 이후 값이 할당된 적이 없는 변수라는 것을 간파할 수 있다. 이 값을 개발자가 마음대로 할당한다면 본래이 취지와 어긋날 수 있으므로 권장하지 않는다. 변수의 값이 없다는 것을 명시하고 싶을 때는 null을 할당한다.`,
    },
  ],
  HTML: [
    {
      quiz: "DOM이란?",
    },
  ],
};

export default data;
