const data = {
  General: [
    {
      quiz: "자기소개 해주세요.",
    },
    {
      quiz: "왜 프로그래머가 되기로 하셨나요?",
    },
    {
      quiz: "부트캠프에서 어떤 걸 배우셨나요?",
    },
    {
      quiz: "왜 프론트엔드에 지원하셨나요?",
    },
    {
      quiz: "문과였던 것 같은데 원래 전공과 지금이 다른 점이 무엇인가요?",
    },
    {
      quiz: "직업을 자주 바꾼 것 같은데 무엇이 본인의 직업을 바꾸게 했나요?",
    },
    {
      quiz: "근무기간이 짧은데 오래 일할 수 있을까요?",
    },
    {
      quiz: "꼭 이루고 싶은 꿈이 있나요? ",
    },
    {
      quiz: "3, 5, 10년 후 본인의 모습을 말해주세요.",
    },
    {
      quiz: "프로그래머로써 목표가 있을까요?",
    },
    {
      quiz: "취미가 어떻게 되시나요?",
    },
    {
      quiz: "스트레스 해소법이 있을까요?",
    },
    {
      quiz: "살면서 풀리지 않는 문제에 부딪힌 경험, 극복한 경험이 있을까요?",
    },
    {
      quiz: "경력이 없는데 왜 우리 회사가 당신을 뽑아야 하나요? 어떤 식으로 기여할 건가요?",
    },
    {
      quiz: "코드 짜다가 모르는 것이 나왔을 경우 어떻게 해결하나요?",
    },
    {
      quiz: "본인의 장단점을 어필해주세요.",
    },
    {
      quiz: "어떤 코드가 좋은 코드라고 생각하세요?",
    },
    {
      quiz: "어떤 동료가 좋은 동료라고 생각하세요?",
    },
    {
      quiz: "영어 잘 하나요?",
    },
    {
      quiz: "개발자로 전향을 결심한 이유가 무엇인가요?",
    },
    {
      quiz: "프론트엔드 개발자로 지원한 이유가 무엇인가요?",
    },
    {
      quiz: "요즘 관심을 가지고 있거나 개인적으로 공부하고 있는 기술이 있나요?",
    },
    {
      quiz: "개발 공부는 어떤 식으로 하셨나요?",
    },
    {
      quiz: "좋은 개발자, 좋은 코드는 무엇이라고 생각하시나요?",
    },
    {
      quiz: "렌더링 최적화 경험에 대해 설명해 주세요.",
    },
    {
      quiz: "본인만의 핵심 역량은 무엇인가요?",
    },
    {
      quiz: "개발자로서의 목표가 무엇인가요?",
    },
    {
      quiz: "원하는 근무 분위기가 있나요?",
    },
    {
      quiz: "이전 직장에서의 경험에 대해 설명해 주세요.",
    },
    {
      quiz: "주변으로부터 자주 받았던 피드백 내용은 무엇인가요?",
    },
    {
      quiz: "5년 후에 어떤 개발자가 되고 싶나요?",
    },
    {
      quiz: "출시된 서비스가 실패한 경우, 그 이유는 무엇이라고 생각하시나요?",
    },
    {
      quiz: "이 회사에 본인이 기여할 수 있는 점이 무엇이라고 생각하시나요?",
    },
    {
      quiz: "화가 나거나 스트레스를 받을 때 주로 어떻게 대처하시나요?",
    },
    {
      quiz: `함께 일하기 싫은 사람은 어떤 유형인가요?
      - 실제로 그런 사람을 만났을 경우에는 어떻게 대응하실 건가요?`,
    },
    {
      quiz: "개발을 할 때 가장 중요하다고 생각하는 요소가 무엇인가요?",
    },
    {
      quiz: "개발 과정에서 막히는 부분이 생겼을 때 어떻게 해결하시나요?",
    },
    {
      quiz: "입사 후, 정해진 기한 내에 맡은 task를 해결하지 못 할 것 같은 상황에서 어떻게 대처하실 건가요?",
    },
    {
      quiz: "원래 전공을 선택했던 이유는 무엇인가요?",
    },
    {
      quiz: "전공 선택 이후 해당 커리어패스를 선택하게 된 과정이 어떻게 되나요?",
    },
    {
      quiz: "이력서에서 다른 어필 포인트가 많았을 텐데 그 부분을 어필한 이유는 무엇인가요? 이와 관련해서 자신의 장점을 말해주세요.",
    },
    {
      quiz: "소프트웨어 중심 기업과 문화가 다른데 괜찮은가요?",
    },
    {
      quiz: "본인이 생각하는 일이란?",
    },
    {
      quiz: "회사를 선택할 때 중요한 부분이 무엇인가요?",
    },
    {
      quiz: "새로운 것을 빨리 배우는 편인가요? 그렇다면 최근에 빨리 배운 것은 무엇인가요?",
    },
    {
      quiz: "본인의 가장 큰 성공과 실패를 말해주세요.",
    },
    {
      quiz: "단기적인 목표를 희생해서 장기적인 목표를 이룬 경험이 있나요? 이에 대해 어떻게 생각하는지 말해주세요",
    },
    {
      quiz: "롤 모델이 있나요? 롤 모델을 닮아가려고 하는 노력들이 있다면 무엇인가요?",
    },
    {
      quiz: "1등을 해본 경험이 있나요?",
    },
    {
      quiz: "왜 우리 회사에 오고 싶나요?",
    },
    {
      quiz: "우리 회사에서 사용하는 스택들에 대한 지식이 있나요?",
    },
  ],
  Project: [
    {
      quiz: "프로젝트 각각 짧게 소개해주세요.",
    },
    {
      quiz: "팀 프로젝트 진행 시 주도적으로 이끌었나요? 아니면 잘 따르는 편이었나요?",
    },
    {
      quiz: `- 팀원들과 의견 충돌 또는 갈등을 겪은 경험이 있나요?
      - 그럴 때는 어떻게 해결하셨나요?`,
    },
    {
      quiz: "개인 프로젝트 진행 시 힘들었던 점은 무엇인가요?",
    },
    {
      quiz: "개인 프로젝트와 팀 프로젝트 중 어떤 것을 선호하시나요?",
    },
    {
      quiz: "협업에서 중요한 것이 뭐라고 생각하시나요?",
    },
    {
      quiz: "코드리뷰했을 때 팀 분위기가 어땠나요?",
    },
    {
      quiz: "프로젝트 중에서 가장 어려웠던 부분, 가장 구현하기 힘들었던 부분을 말해주세요.",
    },
    {
      quiz: "프로젝트하면서 동료와의 갈등이 있었나요?",
    },
    {
      quiz: "프로젝트에서 해당 기술(ex. 리덕스, 리액트, 노드js 등등)을 왜 썼나요?",
    },
    {
      quiz: "프로젝트하며 배운 것이 무엇인가요?",
    },
    {
      quiz: "왜 프로젝트에서 라이브러리 사용을 최소화했나요?",
    },
    {
      quiz: "프로젝트에서 가장 신경써서 작업한 부분은 무엇인가요?",
    },
    {
      quiz: "모든 팀원들의 수준이 다 같지 않았을텐데 문제 없었나요?",
    },
    {
      quiz: "프로젝트에서 사용한 툴(husky, eslint, stylelint 등)을 도입한 계기, 필요성과 장단점을 얘기해주세요",
    },
    {
      quiz: "프로젝트는 단순 포트폴리오용으로 작업한 것인가요? 아니라면 추가로 유지보수 및 개선작업을 한 것이 있나요? 그런 선택을 한 이유는 뭐죠?",
    },
    {
      quiz: "팀프로젝트 시 브랜치 전략은 어떤 것을 사용했나요?",
    },
    {
      quiz: "코드리뷰는 어떻게 했나요?",
    },
    {
      quiz: "개인프로젝트를 애자일 스프린트로 했다고 하는데 스크럼마스터는 누구였나요? 혼자서 회고를 어떻게 했는지? 회고할 때 어려움은 없었나요?",
    },
    {
      quiz: "리드미에 기록된 이 부분 배포된 프로젝트에 실제로 구현되어 있는 것이 맞나요? 어떻게 하면 확인(접근)할 수 있나요?",
    },
    {
      quiz: "왜 라이브러리 없이 바닐라로 구현하는 방식은 고려하지 않았나요? 혹시 라이브러리 없이는 구현할 수 없어서 그런건가요?",
    },
  ],
  JS: [
    {
      quiz: "식별자란?",
      answer: `식별자는 어떤 대상을 유일하게 식별할 수 있는 이름을 말한다. 식별자에는 변수명, 함수명, 프로퍼티명, 클래스명 등이 있다.식별자는 데이터가 저장된 메모리 상의 주소를 기억한다. 따라서 식별자를 통해 메모리에 저장된 값을 참조할 수 있다.`,
    },
    {
      quiz: "변수란?",
      answer: `변수는 값의 위치(주소)를 기억하는 저장소. 즉 변수란 값이 위치하고 있는 메모리 주소에 접근하기 위해 사람이 이해할 수 있는 언어로 명명한 식별자(identifier)이다.`,
    },
    {
      quiz: "undefined에 대해서 설명해주세요.",
      answer: `undefined 타입의 값은 undefined가 유일하다. 선언 이후 값을 할당하지 않은 변수는 undefined값을 가진다. 이는 변수 선언에 의해 확보된 메모리 공간을 처음 할당이 이루어질 때까지 빈 상태로 내버려두지 않고 자바스크립트 엔진이 undefined로 초기화 하기 때문이다.

      - undefined는 개발자가 의도적으로 할당한 값이 아니라 자바스크립트 엔진에 의해 초기화된 값이다. 변수를 참조했을 때 undefined가 반환된다면 참조한 변수가 선언 이후 값이 할당된 적이 없는 변수라는 것을 간파할 수 있다. 이 값을 개발자가 마음대로 할당한다면 본래이 취지와 어긋날 수 있으므로 권장하지 않는다. 변수의 값이 없다는 것을 명시하고 싶을 때는 null을 할당한다.`,
    },
    {
      quiz: "이벤트 위임에 대해 설명해주세요 ",
    },
    {
      quiz: "이벤트 버블링을 사용해보신 적 있으신가요?",
    },
    {
      quiz: "garbage collection 대해 설명해주세요 ",
    },
    {
      quiz: "RDB에 대해 설명해주세요 ",
    },
    {
      quiz: "자료구조(해시테이블)에 대해 설명해주세요 ",
    },
    {
      quiz: "바이너리 서치 트리에 대해 설명해주세요 ",
    },
    {
      quiz: "정렬에 대해 설명해주세요 ",
    },
    {
      quiz: "This에 대해 설명해주세요 ",
    },
    {
      quiz: "call, apply, bind에 대해 설명해주세요 ",
    },
    {
      quiz: "async await와 promise에 대해 설명해주세요 ",
    },
    {
      quiz: "MVC, MVVC에 대해 설명해주세요 ",
    },
    {
      quiz: "call by reference, call by value에 대해 설명해주세요 ",
    },
    {
      quiz: "primitive 타입과 object의 차이점, 특징에 대해 설명해주세요 ",
    },
    {
      quiz: "실행컨텍스트와 렉시컬 환경에 대해 설명해주세요 ",
    },
    {
      quiz: "호이스팅에 대해 설명해주세요 ",
    },
    {
      quiz: "클로저에 대해 설명해주세요 ",
    },
    {
      quiz: "스코프에 대해 설명해주세요 ",
    },
    {
      quiz: "TDZ에 대해 설명해주세요 ",
    },
    {
      quiz: "1급 객체의 조건이 뭔지 아시나요?",
    },
    {
      quiz: "Event loop와 js 실행 순서를 설명해주세요.",
    },
    {
      quiz: "var let const 차이점에 대해 설명해주세요.",
    },
    {
      quiz: "cors의 정의와 생긴 이유, 어떻게 우회하는지 설명해주세요.",
    },
    {
      quiz: "Restful api를 왜 써야하는지 설명해주세요.",
    },
    {
      quiz: "http와 https의 차이를 아시나요? 장단점과 함께 설명해주세요.",
    },
    {
      quiz: "바벨에 대해 아는 만큼 서술해주세요.",
    },
    {
      quiz: "웹팩 대해 아는 만큼 서술해주세요.",
    },
    {
      quiz: "같은 크기의 웹팩으로 압축한 프로젝트와 웹팩으로 압축하지 않은 프로젝트가 있을 때 무엇이 더 좋을까요? 그 이유는?",
    },
    {
      quiz: "더블 이퀄 & 트리플이퀄에 대해 아는 만큼 설명해주세요.",
    },
    {
      quiz: "커링에 대해 설명해주세요 ",
    },
    {
      quiz: "재귀를 써보신 적 있나요?",
    },
    {
      quiz: "js와 jsx의 차이를 말해주세요.",
    },
    {
      quiz: "CDN에 대해 설명해주세요 ",
    },
    {
      quiz: "ES6(2015)를 지원하지 않는 곳에서 자바스크립트를 써야한다면?",
    },
    {
      quiz: "얕은 복사 깊은 복사에 대해 설명해주세요 ",
    },
    {
      quiz: "자바스크립트의 데이터 타입을 모두 나열해 주세요.",
    },
    {
      quiz: "객체의 프로토타입에 대해 설명해 주세요.",
    },
    {
      quiz: "Falsy로 평가되는 값은 무엇인가요?",
    },
    {
      quiz: "Event Loop에 대해 설명해 주세요.",
    },
    {
      quiz: "일반 함수와 화살표 함수의 차이점은 무엇인가요?",
    },
    {
      quiz: "var, let, const 키워드의 차이점을 설명해 주세요.",
    },
    {
      quiz: "ES6에서 추가된 문법을 아는대로 설명해 주세요.",
    },
    {
      quiz: "== 연산자와 === 연산자의 차이점을 설명해 주세요.",
    },
    {
      quiz: "Hash Table에 대해 설명해 주세요.",
    },
    {
      quiz: "OOP에 대해 아는대로 설명해 주세요.",
    },
    {
      quiz: "모듈 패턴에 대해 설명해 주세요.",
    },
    {
      quiz: "팩토리 패턴에 대해 설명해 주세요.",
    },
    {
      quiz: "정렬 알고리즘 중 가장 빠른 것은 무엇인가요?",
    },
    {
      quiz: "동기 프로그래밍과 비동기 프로그래밍의 차이점을 설명해 주세요.",
    },
    {
      quiz: "클로저에 대해 아는대로 설명해 주세요.",
    },
    {
      quiz: "이벤트 위임(버블링, 캡쳐링의 차이)이 무엇인지, 적용 경험이 있는지, 왜 적용했는지",
    },
    {
      quiz: "함수를 선언할 때 표현식, 선언식 중에 무엇을 선호하는지? 그 이유는?",
    },
    {
      quiz: "스코프란 무엇인지?",
    },
    {
      quiz: "스코프 관점에서 var let const를 설명해줄 수 있는지?",
    },
    {
      quiz: "클로저란 무엇인지?",
    },
    {
      quiz: "null, undefined란 무엇이고 어떻게 구분하는지?",
    },
    {
      quiz: "(내부 함수는 실행이 종료된 외부 함수의 스코프에 접근할 수 있다고 했는데) 구체적으로 어떻게 접근할 수 있게 되는지?",
    },
  ],
  HTML: [
    {
      quiz: "DOM이란?",
    },
    {
      quiz: "브라우저의 랜더링 원리에 대해 설명해주세요.",
    },
    {
      quiz: "repaint과 reflow의 차이점을 아시나요?",
    },
    {
      quiz: "local storage, session storage, cookie. 로그인 외에 어떤 경우에 쓸수있는지 아시나요? 장단점과 함께 설명해주세요. ",
    },
    {
      quiz: "브라우저의 랜더링 원리에 대해 설명해주세요.",
    },
    {
      quiz: "시멘틱 마크업에 대해 설명해주세요.",
    },
  ],
  CSS: [
    {
      quiz: "CSS inline, block, inline-block 의 차이점을 말해주세요.",
    },
    {
      quiz: "Box Model에 대해 설명해 주세요.",
    },
    {
      quiz: "Position 속성에 대해 설명해 주세요.",
    },
    {
      quiz: "z-index가 무엇인가요?",
    },
    {
      quiz: "CSS와 CSS in JS에 대해 설명해 주세요.",
    },
    {
      quiz: "flex, grid에 대해 설명해 주세요.",
    },
    {
      quiz: "CSS selector에 대해 설명해 주세요.",
    },
    {
      quiz: "CSS sprite에 대해 설명해 주세요.",
    },
    {
      quiz: "rem은 무엇이고 어떨 때 사용하나요?",
    },
    {
      quiz: "reset CSS, normalize CSS에 대해 설명해주세요",
    },
    {
      quiz: "(대부분의 프로젝트를 React styled-components로 진행했는데) 일반 CSS 대비 CSS-in-JS의 장단점은 무엇인가요?",
    },
  ],
  React: [
    {
      quiz: "리액트에서 랜더링 과정을 설명해주세요",
    },
    {
      quiz: "리액트는 어떻게 변화를 감지하나요?",
    },
    {
      quiz: "훅이란? 훅을 사용하는 이유는 뭔가요?",
    },
    {
      quiz: "써본 훅이 있는지? 그건 어떤 훅이고 어떻게 작동하나요?",
    },
    {
      quiz: "제일 좋아하는 리액트 관련 라이브러리는 무엇인가요?",
    },
    {
      quiz: "제일 좋아하는 (많이 써본) 훅은? 그 훅에 대해 설명해주세요.",
    },
    {
      quiz: "컴포넌트의 생명주기에 대해 설명해주세요 ",
    },
    {
      quiz: "useMemo와 React.memo를 비교해주실 수 있나요?",
    },
    {
      quiz: "redux를 사용하는 이유에 대해 설명해주세요 ",
    },
    {
      quiz: "리덕스를 사용했을 경우, 실제로는 state가 어디에 저장되는지 설명해주세요 ",
    },
    {
      quiz: "디핑 알고리즘에 대해 설명해주세요 ",
    },
    {
      quiz: "고차 컴포넌트 (hoc)에 대해 설명해주세요 ",
    },
    {
      quiz: "state를 왜 직접 수정하면 안되는지 설명해주세요 ",
    },
    {
      quiz: "리액트의 단점이 무엇이라고 생각하나요?",
    },
    {
      quiz: "클래스형으로 쓰는 것과 함수형으로 쓰는 것의 차이점에 대해 설명해주세요 ",
    },
    {
      quiz: "리액트가 오브젝트를 그리는 것과 따로 사용한 라이브러리가 오브젝트를 그리는 것, 둘 중에 어떤 것이 더 나은가요? 둘의 장단점을 말해주세요.",
    },
    {
      quiz: "왜 CRA를 사용해야하는지에 대해 설명해주세요 ",
    },
    {
      quiz: "ECMAScript와 JavaScript의 차이점은 무엇인가요?",
    },

    {
      quiz: "DOM과 VirtualDOM은 각각 무엇이고, VirtualDOM의 이점은 무엇인가요?",
    },
    {
      quiz: "리덕스가 무엇이고, 사용했을 때의 이점은 무엇인가요?",
    },
    {
      quiz: "리액트를 사용하는 이유가 무엇이라고 생각하시나요?",
    },
    {
      quiz: "컴포넌트를 재사용했던 경험이 있나요?",
    },
    {
      quiz: "컴포넌트를 재사용할 때 겪었던 문제점은 무엇인가요?",
    },
    {
      quiz: "기억에 남는 상태 관리 경험에 대해 설명해 주세요.",
    },
    {
      quiz: "경험해본 상태관리 방식(context api, redux ...)에 무엇이 있는지와 장단점, 선택한 이유",
    },
  ],
  ETC: [
    {
      quiz: "TypeScript나 Flow를 사용해본 경험이 있나요? 있다면 도입하게 된 계기와 장단점을 말해주세요.",
    },
    {
      quiz: "과제 혼자 완성한 것이 맞나요? 부트캠프의 선생님 등이 도와준 것은 아닌가요?",
    },
    {
      quiz: "과제에 시간이 더 있었다면 어떻게 했을 것 같은지 개선방향, 아쉬운 점 말해주세요",
    },
    {
      quiz: "과제에서 해당 라이브러리를 선택한 이유와 이점을 말해주세요.",
    },
    {
      quiz: "테스트가 필요한 이유와 작성시 이점을 말해주세요.",
    },
    {
      quiz: "유닛, 통합, e2e 테스트 중 작성해본 테스트가 있나요?",
    },
    {
      quiz: "테스트케이스 정의는 어떻게 하나요?",
    },
    {
      quiz: "일부만 테스트해야한다고 할 때, 테스트 범위와 우선순위 선정은 어떻게 할 것인가요?",
    },
    {
      quiz: "쿠키에 대해 설명해 주세요.",
    },
    {
      quiz: "컴포넌트 테스트는 어떻게 하나요?",
    },
    {
      quiz: "Local Storage를 사용할 때의 장 / 단점에 대해 설명해 주세요.",
    },
    {
      quiz: "컴포넌트 테스트는 어떻게 하나요?",
    },
    {
      quiz: "디렉토리 구조에 대해 고민했던 경험이 있나요?",
    },
    {
      quiz: "디자인 시스템에 대해 아는대로 설명해 주세요.",
    },
    {
      quiz: "TDD(Test-Driven-Development)와 DDD(Domain-Driven-Development)에 대해서 아나요?",
    },
    {
      quiz: "JsonWebToken에 대해 설명해 주세요.",
    },
    {
      quiz: "MongoDB를 사용한 이유가 무엇인가요?",
    },
    {
      quiz: "컴포넌트 테스트는 어떻게 하나요?",
    },
  ],
};

export default data;
